Revit 2026 API

# AssemblyInstanceAreElementsValidForAssembly Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool AreElementsValidForAssembly(
	Document document,
	ICollection<ElementId> assemblyMemberIds,
	ElementId assemblyId
)
```
```vb
Public Shared Function AreElementsValidForAssembly (
	document As Document,
	assemblyMemberIds As ICollection(Of ElementId),
	assemblyId As ElementId
) As Boolean
```
```cpp
public:
static bool AreElementsValidForAssembly(
	Document^ document,
	ICollection<ElementId^>^ assemblyMemberIds,
	ElementId^ assemblyId
)
```
```fsharp
static member AreElementsValidForAssembly :
        document : Document *
        assemblyMemberIds : ICollection<ElementId> *
        assemblyId : ElementId -> bool
```

#### Parameters

document Document

assemblyMemberIds ICollectionElementId

assemblyId ElementId

#### Return Value

Boolean

#### Reference

AssemblyInstance Class

Autodesk.Revit.DB Namespace